CFD/OPENFOAM/sim1/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

xMin   -10.0;
xMax    15.6;
yMin    0;
yMax   10.24;
zMin    0;
zMax    10.24;
baseSize  0.512;
xCells  #calc "1/$baseSize * ($xMax - $xMin)";
yCells  #calc "1/$baseSize * ($yMax - $yMin)";
zCells  #calc "1/$baseSize * ($zMax - $zMin)";

convertToMeters 1;

vertices
(
    ($xMin $yMin $zMin)
    ($xMax $yMin $zMin)
    ($xMax $yMax $zMin)
    ($xMin $yMax $zMin)

    ($xMin $yMin $zMax)
    ($xMax $yMin $zMax)
    ($xMax $yMax $zMax)
    ($xMin $yMax $zMax)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) ($xCells $yCells $zCells) simpleGrading (1 1 1)
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 3 7 4)
        );
    }

    freestream
    {
        type patch;
        faces
        (
            (1 5 6 2)
            (4 7 6 5)
            (3 2 6 7)
        );
    }
    symmetry
    {
        type symmetryPlane;
        faces
        (
            (0 4 5 1)
        );
    }

    ground
    {
        type wall;
        faces
        (
            (0 1 2 3)
        );
    }
);


// ************************************************************************* //
