CFD/OPENFOAM/sim1/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    freestream
    {
        type            freestreamPressure;
        freestreamValue uniform 0;
        supersonic      false;
        value           uniform 0;
    }

    symmetry
    {
        type symmetryPlane;
    }

    ground
    {
        type            zeroGradient;
    }
    "(body|.*Wheel)"
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //