CFD/OPENFOAM/sim1/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include    "$FOAM_CASE/constant/caseSettings"

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $kInlet;

boundaryField
{
    inlet
    {
       type            fixedValue;
        value           uniform $kInlet;
    }
    outlet
    {
        type            zeroGradient;
    }
    freestream
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    symmetry
    {
        type symmetryPlane;
    }
    ground
    {
        type            kLowReWallFunction;
        value           $internalField;
    }
    "(body|.*Wheel)"
    {
        type            kqRWallFunction;
        value           $internalField;
    }
}


// ************************************************************************* //
