CFD/OPENFOAM/sim1/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-7;
        relTol          0.01;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 1000; 
        agglomerator    faceAreaPair;
    }

    pFinal
    {
        $p;
        relTol         0;
    }

    Phi
    {
        $p;
    }

    "(U|k|omega|epsilon)"
    {
        
        solver          smoothSolver;
        smoother        symGaussSeidel;
        /*
        solver          PBiCGStab;
        preconditioner  DILU;
        */
        tolerance       1e-7;
        relTol          0.1;
    }

    "(U|k|omega|epsilon)Final"
    {
        $U;
        relTol          0;
    }
    
}

SIMPLE
{
    residualControl
    {
        p               1e-4;
        U               1e-4;
        "(k|omega|epsilon)" 1e-4;
    }
    nNonOrthogonalCorrectors 3;
    pRefCell        0;
    pRefValue       0;

}

potentialFlow
{
    nNonOrthogonalCorrectors 10;
}

relaxationFactors
{
    fields
    {
        p               0.3;
    }
    equations
    {
        U               0.7;
        "(k|omega|epsilon)" 0.7;
    }
}

// ************************************************************************* //
