CFD/OPENFOAM/sim1/system/sample
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sample;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type surfaces;
libs ("libsampling.so");

setFormat raw;
surfaceFormat raw;

interpolationScheme cellPoint;

fields
(
p
wallShearStress
);


sets
(
);

surfaces
(
 airfoilBoundary
 {
   type patch;
   axis xyz;
   //patchName airfoilBoundary;
   patches (airfoilBoundary);
 }
);

// *********************************************************************** //
