CFD/OPENFOAM/sim1/system/surfaceFeaturesDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      surfaceFeaturesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

surfaces
(
    "body.stl"
    "frontWheel.stl"
    "rearWheel.stl"
);

extractionMethod    extractFromSurface;

includedAngle   160;

subsetFeatures
{
    nonManifoldEdges    no;
    openEdges           yes;
}

writeObj            yes;

// ************************************************************************* //
